schmmd/soleCAN/esp32-s3/src/main.cpp
struct MotorState {
    int16_t  rpm_signed    = 0;
    uint16_t rpm_magnitude = 0;
    int8_t   direction     = 0;
    uint8_t  range    = 1;
    // LE u16: commanded effort magnitude; peaks past 255 under hard
    // acceleration (observed 262), so a single byte would wrap.
    uint16_t torque_raw  = 0;
    int8_t   controller_temp_c = INT8_MIN;
    int8_t   motor_temp_c      = INT8_MIN;
    bool     valid             = false;
    uint32_t last_seen_ms      = 0;
};

struct ChargerState {
    uint8_t  flags    = 0;
    uint16_t v_raw    = 0;
    uint16_t i_raw    = 0;
    float    voltage_v = NAN;
    float    current_a = NAN;
    bool     valid    = false;
};

struct ChgrCmdState {
    float    voltage_v = NAN;
    float    current_a = NAN;
    uint8_t  enable    = 1;
    uint16_t v_raw     = 0;
    uint16_t i_raw     = 0;
    bool     valid     = false;
};

struct Dm1State {
    uint8_t  lamp_byte0 = 0, lamp_byte1 = 0;
    uint32_t dtc_spn    = 0;
    uint8_t  dtc_fmi    = 0, dtc_cm = 0, dtc_oc = 0;
    bool     valid      = false;
};

#if defined(ENABLE_KELLY)
// Decoded Kelly monitor block. Field offsets and raw semantics mirror
// kelly/solectrac-kelly-monitor.py Monitor.decode (offsets 0..21 defined; the
// rest of the 48-byte block is unknown). Values are kept raw, no scaling, to
// match the Python decode — see kelly/README.md for what's CONFIRMED vs
// TENTATIVE. `valid`/`last_seen_ms` drive JSON freshness like the CAN states.
struct KellyState {
    uint8_t  tps_pedal         = 0;
    uint8_t  b_plus_v          = 0;   // battery volts (raw byte)
    int16_t  motor_temp_c      = 0;
    int16_t  controller_temp_c = 0;
    uint8_t  forward_switch    = 0;
    uint8_t  low_speed         = 0;   // 1 = low setpoint (~2400), 0 = high (~2800)
    uint16_t error_status      = 0;   // 16-bit fault bitmask (bit -> KELLY_ERROR_NAMES)
    uint16_t motor_speed_rpm   = 0;
    uint16_t phase_current_a   = 0;
    bool     valid             = false;
    uint32_t last_seen_ms      = 0;
};
#endif

// ── Global state ──────────────────────────────────────────────────────────────
// All updated from the CAN decode path inside loop(), read when building JSON
// from the same thread — no locking needed.

float       g_cell_v[NUM_CELLS];
float       g_temp_c[NUM_TEMPS];
PackState   g_pack;
BmsStateFlags g_bms_state;
BmsLimits   g_bms_limit;
BmsFaults   g_bms_faults;
MotorState  g_motor;
ChargerState g_charger;
ChgrCmdState g_chgr_cmd;
#if defined(ENABLE_KELLY)
KellyState  g_kelly;   // updated by kellyPoll() in loop(), read when building JSON
// Debug counters, always exposed in /json under "kelly_dbg" so we can see the
// serial path even when no valid frame decodes: how many polls fired, how many
// bytes came back, and the raw hex of the last chunk received.
uint32_t    g_kelly_polls    = 0;   // query cycles started
uint32_t    g_kelly_rx_total = 0;   // total bytes ever read from the Kelly UART
uint8_t     g_kelly_last_rx[32];    // last raw chunk received
uint8_t     g_kelly_last_rx_len = 0;
// Flicker/reliability counters: how cleanly frames land.
uint32_t    g_kelly_frames_ok   = 0;      // replies that checksummed
uint32_t    g_kelly_frames_bad  = 0;      // bytes arrived but no frame checksummed
uint32_t    g_kelly_timeouts    = 0;      // no bytes at all (controller unpowered/absent)
uint32_t    g_kelly_blocks_ok   = 0;      // full 48-byte blocks decoded (a card update)
uint32_t    g_kelly_last_block_ms    = 0; // millis() of last full decode
uint32_t    g_kelly_block_gap_max_ms = 0; // worst gap between full decodes (worst flicker)
#endif
uint8_t     g_vc_state   = 0xFF;   // 0xFF = never seen
uint8_t     g_dash_alive = 0xFF;
Dm1State    g_dm1;

// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
uint32_t    g_last_http_ms   = 0;   // millis() at last served HTTP request (defers quiet sleep)
uint32_t    g_can_recoveries = 0;   // bus-off recoveries initiated since boot
uint32_t    g_socketcand_tx_dropped = 0;   // frames dropped on full client TCP buffers
uint32_t    g_slcan_tx_dropped = 0;   // frames dropped on a full USB-CDC TX buffer (stalled reader)
bool        g_can_initialized = false;
bool        g_ap_running      = false;

// STA join telemetry for /config. Written by the WiFi event callback, which
// runs on the system event task rather than the loop task — hence volatile
// single-word values (torn reads aren't possible at word width or below).
volatile uint32_t g_sta_disconnects = 0;
volatile uint8_t  g_sta_last_disconnect_reason = 0;   // 0 = never disconnected

// Runtime STA credentials — the single source of truth for the station join.
// Seeded from NVS if provisioned, else from the compiled WIFI_SSID/WIFI_PASS
// defaults. Written by the /wifi POST handler.
char g_sta_ssid[33] = "";
char g_sta_pass[64] = "";
static Preferences g_prefs;

static inline bool staConfigured() { return g_sta_ssid[0] != '\0'; }

// NVS 'wifi' namespace overrides the compiled defaults; an absent 'ssid' key
// means "never provisioned", so fall back to the baked-in defaults (keeps the
// default build's behavior). Call once, before WiFi bring-up.
static void loadStaCreds() {
    g_prefs.begin("wifi", /*readOnly=*/true);
    if (g_prefs.isKey("ssid")) {
        g_prefs.getString("ssid", g_sta_ssid, sizeof(g_sta_ssid));
        g_prefs.getString("pass", g_sta_pass, sizeof(g_sta_pass));
    } else {
        strlcpy(g_sta_ssid, WIFI_SSID, sizeof(g_sta_ssid));
        strlcpy(g_sta_pass, WIFI_PASS, sizeof(g_sta_pass));
    }
    g_prefs.end();
}

#if defined(HAS_MCP2515)
bool        g_mcp_initialized = false;
uint32_t    g_mcp_init_err    = 0xFFFFFFFFUL;   // sentinel: never attempted
uint32_t    g_mcp_frames_rx   = 0;
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

#if defined(HAS_VIN_SENSE)
float       g_vin_v = NAN;   // most recent 12 V supply reading, averaged
#endif

#if defined(AUTOSHUTDOWN)
esp_sleep_wakeup_cause_t g_wake_cause = ESP_SLEEP_WAKEUP_UNDEFINED;   // set once in setup()
#endif

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;
// First BMS-published SOC seen this session; current - start = session ΔSOC.
float       g_session_soc_start_pct = NAN;

