schmmd/soleCAN/esp32-s3/src/main.cpp
// UART1 is the Kelly port and nothing else, so name it for what is on the far
// end rather than for the peripheral index.
static HardwareSerial &kelly = Serial1;

// The Kelly transmits at its documented 19200 baud — fixed, no sweep; CONFIRMED
// by sustained ~99% frame success. An earlier ~19,900 figure (crystal-referenced
// edge timing) was measured through a doubly-corrupted receive path — an
// Arduino core 2.0.x firmware bug (fixed by the pioarduino/core-3.x platform,
// see platformio.ini) on top of the noisy RXD0 console pad (GPIO44, since
// moved to GPIO47/48) — and is void. The full story is in kelly/README.md
// §"Actual line rate".
static const uint32_t KELLY_BAUD = 19200;
static const uint8_t  KELLY_MON_CMDS[3]      = {0x3A, 0x3B, 0x3C};
static const uint32_t KELLY_POLL_INTERVAL_MS = 40;     // gap between individual queries
static const uint32_t KELLY_CMD_TIMEOUT_MS   = 600;    // per-command reply wait
                                                       // (matches the Python
                                                       // monitor's 0.6 s; the
                                                       // Kelly's turnaround plus
                                                       // loop latency exceeds a
                                                       // short window)
static const uint32_t KELLY_STALE_MS         = 5000;   // JSON freshness window (a
                                                       // little headroom over the
                                                       // observed worst-case gap)

// Display-only fault names by error_status bit (0..15). Kept in the renderer per
// project convention; the encoding (BE u16 @ block offset 16) is the protocol
// fact. Mirrors ERROR_NAMES in solectrac-kelly-monitor.py.
static const char* const KELLY_ERROR_NAMES[16] = {
    "Identify Err", "Over Volt", "Low Volt", "Reserved",
    "Locking", "V+ Err", "Overtemp", "High Pedel",
    "Reserved", "Reset Error", "Pedel Error", "Hall Sensor Error",
    "Reserved", "Emergency Rev Err", "Motor OverTemp Err", "Current Meter Err",
};

// Read-only transmit chokepoint: only the three zero-data monitor queries are
// ever put on the wire (mirrors READ_ONLY_COMMANDS in the Python monitor). No
// flash session is opened, so the firmware cannot write or reconfigure the
// controller — read-only by construction.
static bool kellyIsMonitorCmd(uint8_t cmd) {
    return cmd == 0x3A || cmd == 0x3B || cmd == 0x3C;
}
static void kellySendQuery(uint8_t cmd) {
    if (!kellyIsMonitorCmd(cmd)) return;          // refuse anything else
    const uint8_t frame[3] = {cmd, 0x00, cmd};    // [CMD, LEN=0, CHK=CMD]
    kelly.write(frame, sizeof(frame));
}

// Decode the 48-byte block into g_kelly. Offsets and raw (unscaled) semantics
// mirror Monitor.decode; only offsets 0..21 are defined by the protocol.
static void kellyDecodeBlock(const uint8_t* b) {
    g_kelly.tps_pedal         = b[0];
    g_kelly.forward_switch    = b[4];
    g_kelly.b_plus_v          = b[9];
    g_kelly.motor_temp_c      = b[10];   // raw byte, as the Python decode leaves it
    g_kelly.controller_temp_c = b[11];
    g_kelly.low_speed         = b[15];
    g_kelly.error_status      = (uint16_t(b[16]) << 8) | b[17];   // big-endian
    g_kelly.motor_speed_rpm   = (uint16_t(b[18]) << 8) | b[19];
    g_kelly.phase_current_a   = (uint16_t(b[20]) << 8) | b[21];
    g_kelly.valid             = true;
    g_kelly.last_seen_ms      = millis();
}


void kellyInit() {
    // kelly.begin(baud, config, rxPin, txPin). The Kelly runs at a fixed 19200.
    kelly.begin(KELLY_BAUD, SERIAL_8N1, KELLY_RXD_PIN, KELLY_TXD_PIN);
}

// Fault-tolerant poller. Rotates through the monitor commands one at a time,
// caching each good reply in its own 16-byte slot with a timestamp. The decoded
// reading is rebuilt whenever every needed slot is recently fresh — so a single
// corrupted reply (EMI, a marginally-off baud) only delays that one slot instead
// of dropping the whole reading and flickering the card. Only 0x3A and 0x3B are
// polled: their 32 bytes carry every field kellyDecodeBlock reads (offsets
// 0..21); 0x3C's bytes are unused, so skipping it halves the frames per reading.
static const uint8_t KELLY_N_POLL = 2;   // poll KELLY_MON_CMDS[0..1] = 0x3A, 0x3B
void kellyPoll() {
    static enum { KIDLE, KWAIT } state = KIDLE;
    static uint8_t  block[KELLY_N_POLL * 16];
    static uint32_t slot_ms[KELLY_N_POLL] = {0};   // when each slot last refreshed
    static uint8_t  rxbuf[40];
    static uint8_t  rxlen  = 0;
    static uint8_t  cur    = 0;      // command index currently in flight
    static uint32_t next_ms = 0;     // earliest time to send the next query
    static uint32_t sent_ms = 0;     // when the current query went out
    static uint32_t sent_rx_total = 0;   // g_kelly_rx_total when the query went out

    uint32_t now = millis();

    if (state == KIDLE) {
        if (now < next_ms) return;
        rxlen = 0;
        while (kelly.available()) kelly.read();   // drop stale bytes
        g_kelly_polls++;
        kellySendQuery(KELLY_MON_CMDS[cur]);
        sent_ms = now;
        sent_rx_total = g_kelly_rx_total;
        state   = KWAIT;
        return;
    }

    // KWAIT: gather the reply for command `cur`, resync on [CMD, 0x10, <16>, CHK].
    while (kelly.available() && rxlen < sizeof(rxbuf)) {
        rxbuf[rxlen++] = (uint8_t)kelly.read();
        g_kelly_rx_total++;
    }
    if (rxlen > 0) {   // snapshot for /json kelly_dbg
        g_kelly_last_rx_len = rxlen < 32 ? rxlen : 32;
        memcpy(g_kelly_last_rx, rxbuf, g_kelly_last_rx_len);
    }
    uint8_t cmd = KELLY_MON_CMDS[cur];
    for (int i = 0; i + 19 <= rxlen; i++) {
        if (rxbuf[i] != cmd || rxbuf[i + 1] != 0x10) continue;
        uint16_t sum = cmd + 0x10;
        for (int j = 0; j < 16; j++) sum += rxbuf[i + 2 + j];
        if ((sum & 0xFF) != rxbuf[i + 18]) continue;   // bad frame: keep scanning
        // Good reply — cache this slot.
        g_kelly_frames_ok++;
        memcpy(&block[cur * 16], &rxbuf[i + 2], 16);
        slot_ms[cur] = now ? now : 1;
        // Rebuild the reading if every slot is populated and recently fresh.
        bool all_fresh = true;
        for (uint8_t s = 0; s < KELLY_N_POLL; s++)
            if (!slot_ms[s] || (now - slot_ms[s]) >= KELLY_STALE_MS) all_fresh = false;
        if (all_fresh) {
            kellyDecodeBlock(block);
            g_kelly_blocks_ok++;
            if (g_kelly_last_block_ms != 0) {
                uint32_t gap = now - g_kelly_last_block_ms;
                if (gap > g_kelly_block_gap_max_ms) g_kelly_block_gap_max_ms = gap;
            }
            g_kelly_last_block_ms = now;
        }
        cur     = (cur + 1) % KELLY_N_POLL;   // next command
        next_ms = now + KELLY_POLL_INTERVAL_MS;
        state   = KIDLE;
        return;
    }
    // No match: slide the window instead of jamming. The Kelly's line can
    // carry a second continuous transmission (~19.9k stream) plus noise, so a
    // fixed snapshot fills with non-reply bytes before the reply arrives.
    // Every start position the scan just exhausted is dead; keep only the
    // tail that could still begin a frame, so the reply is found no matter
    // how much chatter precedes it.
    if (rxlen > 18) {
        memmove(rxbuf, rxbuf + rxlen - 18, 18);
        rxlen = 18;
    }
    if (now - sent_ms > KELLY_CMD_TIMEOUT_MS) {   // no valid reply this attempt
        if (g_kelly_rx_total == sent_rx_total)
            g_kelly_timeouts++;                   // silence: unpowered/absent, not corruption
        else
            g_kelly_frames_bad++;                 // one clean count per failed attempt
        cur     = (cur + 1) % KELLY_N_POLL;       // advance so a dead slot can't stall
        next_ms = now + KELLY_POLL_INTERVAL_MS;
        state   = KIDLE;
    }
}
#endif  // ENABLE_KELLY

// ── JSON builder ──────────────────────────────────────────────────────────────

static void addFloat(JsonObject& obj, const char* key, float v, int decimals = 2) {
    if (!isnan(v)) {
        float factor = 1.0f;
        for (int i = 0; i < decimals; i++) factor *= 10.0f;
        obj[key] = roundf(v * factor) / factor;
    }
}

// `minimal` strips fields the HTML dashboard doesn't render — used to cut BLE
// payload size. The full set is still served at /json. Note the per-cell
// voltage/temperature arrays are NOT stripped: the cell-detail view renders
// them over BLE too.
String buildJson(bool pretty = true, bool minimal = false) {
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif

    // CAN bus health
    auto can = doc["can"].to<JsonObject>();
    if (!g_can_initialized) {
        can["state"] = "not_initialized";
    } else {
        twai_status_info_t si;
        if (twai_get_status_info(&si) == ESP_OK) {
            switch (si.state) {
                case TWAI_STATE_STOPPED:    can["state"] = "stopped";    break;
                case TWAI_STATE_RUNNING:    can["state"] = "running";    break;
                case TWAI_STATE_BUS_OFF:    can["state"] = "bus_off";    break;
                case TWAI_STATE_RECOVERING: can["state"] = "recovering"; break;
                default:                    can["state"] = "unknown";    break;
            }
            if (!minimal) {
                can["tec"]        = si.tx_error_counter;
                can["rec"]        = si.rx_error_counter;
                can["rx_missed"]  = si.rx_missed_count;
                can["bus_errors"] = si.bus_error_count;
                can["bus_recoveries"] = g_can_recoveries;
            }
        }
    }
    can["frames_rx"]      = g_frames_rx;
    if (!minimal) can["mode"] = CAN_TX_ENABLED ? "normal" : "listen_only";
    if (!minimal) can["frames_decoded"] = g_frames_decoded;
    if (!minimal && g_socketcand_tx_dropped)
        can["socketcand_dropped"] = g_socketcand_tx_dropped;
    if (!minimal && g_slcan_tx_dropped)
        can["slcan_dropped"] = g_slcan_tx_dropped;
    if (g_frames_rx > 0)
        can["last_frame_age_s"] = (millis() - g_last_frame_ms) / 1000.0;
#if defined(HAS_MCP2515)
    auto mcp = can["mcp2515"].to<JsonObject>();
    mcp["initialized"] = g_mcp_initialized;
    mcp["init_err"]    = g_mcp_init_err;
    mcp["frames_rx"]   = g_mcp_frames_rx;
    if (!minimal && g_mcp_initialized) {
        // Error-state visibility for can1, matching can0's tec/rec above.
        // Each accessor is one short SPI register read. eflg is the raw EFLG
        // register: bit 5 TXBO (bus-off), bits 4/3 TXEP/RXEP (error-passive),
        // bits 7/6 RX1OVR/RX0OVR (RX buffer overflow).
        mcp["tec"]  = g_mcp.transmitErrorCounter();
        mcp["rec"]  = g_mcp.receiveErrorCounter();
        mcp["eflg"] = g_mcp.errorFlagRegister();
    }
#endif

    // Pack
    auto pack = doc["pack"].to<JsonObject>();
    addFloat(pack, "voltage_v",    g_pack.voltage_v, 2);
    addFloat(pack, "current_a",    g_pack.current_a, 1);
    if (!minimal && g_pack.current_raw >= 0) pack["current_raw"] = g_pack.current_raw;
    addFloat(pack, "power_w",      g_pack.power_w,   1);
    if (!minimal && g_pack.soc_raw) pack["soc_raw"] = g_pack.soc_raw;
    addFloat(pack, "soc_pct",      g_pack.soc_pct,   1);
    if (!minimal) addFloat(pack, "v_estimate", g_pack.v_estimate, 3);
    auto cells_obj = pack["cells"].to<JsonObject>();
    if (g_pack.cell_max_mv >= 0)   cells_obj["max_mv"]    = g_pack.cell_max_mv;
    if (g_pack.cell_min_mv >= 0)   cells_obj["min_mv"]    = g_pack.cell_min_mv;
    if (g_pack.cell_spread_mv >= 0)cells_obj["spread_mv"] = g_pack.cell_spread_mv;
    if (g_pack.cell_max_n)         cells_obj["max_n"]     = g_pack.cell_max_n;
    if (g_pack.cell_min_n)         cells_obj["min_n"]     = g_pack.cell_min_n;
    if (!minimal && g_pack.cell_spread_mv_reported >= 0)
        cells_obj["spread_mv_reported"] = g_pack.cell_spread_mv_reported;
    auto temp = cells_obj["temp_summary"].to<JsonObject>();
    if (g_pack.temp_max_c != INT8_MIN) temp["max_c"]    = g_pack.temp_max_c;
    if (g_pack.temp_min_c != INT8_MIN) temp["min_c"]    = g_pack.temp_min_c;
    if (!minimal) {
        if (g_pack.temp_max_n)             temp["max_n"]    = g_pack.temp_max_n;
        if (g_pack.temp_min_n)             temp["min_n"]    = g_pack.temp_min_n;
        if (g_pack.temp_spread_c >= 0)     temp["spread_c"] = g_pack.temp_spread_c;
    }

    // Session energy summary.
    // Convention: positive = into pack (net charge), negative = out (net draw).
    auto sess = doc["session"].to<JsonObject>();
    sess["wh_drawn"]   = roundf(g_session_wh_drawn   * 10.0f) / 10.0f;
    sess["wh_charged"] = roundf(g_session_wh_charged * 10.0f) / 10.0f;
    sess["wh_net"]     = roundf((g_session_wh_charged - g_session_wh_drawn) * 10.0f) / 10.0f;
    sess["wh_capacity"] = PACK_CAPACITY_WH;
    if (!isnan(g_session_soc_start_pct))
        sess["soc_start_pct"] = roundf(g_session_soc_start_pct * 10.0f) / 10.0f;

    // Session-average net power. Positive = net charging, negative = net drawing.
    // Uses *active* time (sum of valid dt's), so bus-silent gaps don't dilute it.
    float avg_power_w = NAN;
    float active_hours = g_session_active_ms / 3600000.0f;
    if (active_hours > 0.01f) {                            // ≥ ~36 s of data
        avg_power_w = (g_session_wh_charged - g_session_wh_drawn) / active_hours;
        if (!minimal) {
            sess["avg_power_w"] = roundf(avg_power_w * 10.0f) / 10.0f;
            sess["active_s"]    = g_session_active_ms / 1000;
        }
    }

    if (!isnan(g_pack.soc_pct)) {
        float remaining = g_pack.soc_pct * PACK_CAPACITY_WH / 100.0f;
        sess["wh_remaining"] = roundf(remaining * 10.0f) / 10.0f;
        // ETAs use session-average power so they don't jump with instantaneous load
        if (!isnan(avg_power_w)) {
            if (avg_power_w < -50.0f) {
                // Net drawing — extrapolate to empty.
                sess["eta_to_zero_s"] = (uint32_t)(remaining / -avg_power_w * 3600.0f);
            } else if (avg_power_w > 50.0f) {
                // Net charging — extrapolate to full.
                float headroom = PACK_CAPACITY_WH - remaining;
                if (headroom > 0)
                    sess["eta_to_full_s"] = (uint32_t)(headroom / avg_power_w * 3600.0f);
            }
        }
    }

